#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-bqnuDySVZ9NJGmaS

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=314f4be77004f36bd0a441b0e265f6a9891ee5f1]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210823111616479900000001]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210823111616488200000002]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekV4TVRJek9Gb1hEVE14TURneU1URXhNVEl6T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFljCklWSyt5blh6WGpKb3pBd1Q4QmRZNFp5MENXbjErYS9WUytmRGFqWEJzck9uaEZsMnFEd2FXUTNUWUc3aXh2QnAKVEhQNzJOMWl6K1ptYlRiS252RStFYmcwQyt6ZWkzWkpQUnZQQjV4TFY3TzFGTmQ5TzdzMXJkRTlyT0oxYVc2bQpXaVFYUVJCck9uZEdzQ3k0STVCZUlxcXVZbmNweEVpTGRLbXhoM1puVGtNbmFqZHc3U09KbitRWEZvNHRhVUxMCmtEemwvd1FFbTd2dDFjaDZRcmVmZy9jYUFVQk1pTFowMWZKMi9zUmx0cFNXWktsOTI1ZUZjb0RPcFVmVW9ZcSsKQTVyYjQ1YStXOW1aQmMxcXEySFFwVG41cDNROVJZcUJ4RFhORlQwbFdmVFBoWFlvbDZWamZFSjlQQVI4Y2lRNApZNjlJUUZFRmVxbEhCSFd3UVdFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZOcVM3ZVVpRUtTTnVGRzBQTG80L2RFL2xNZThNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDRFZCWkQ2UmR6YlR5NllMMHVBZEFVYlRveTB6Z0xOQlQ2c3ZHays1dzJEdUxRUk5xZgpDSVpSWFh3Z2R1bFdCcWpaQndMNlVoeU9qOUhFbENKdlRGdkhhbm5BeGFhekM2WUY0bHFuUHlBSzlDMXRxUXUzCjEvdTJOcFltL3RWRXRWc2ltOGJnYUp2eFdoRmFWRTlpSFRDQ0hYbGt4T0JENWVqaXl4M296SnAwcmNsMjJoNDAKWkFTTkh1VE5TQzNpaWRITUFOZkpndW8yWUZQWEQxeXhwbi9rS1h2SnBkZHpveTRHNDBnVkZJaWtJeVZWdjlDZQpXcisxMjJ0SFA0VUd2TDVpVDN4ODd1eUUwa1ZOeTd4ZGo2d0wyWVFnWjlsUGxsNGpBOUxnKzBua1d6WWVvMVc4CllEZEJIajFIbHZYMWI4bXFsRDVjemlLY3RxZ0JhUEN1YTV4YgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-23 11:06:35.964 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/9C224726DF76F313B6AF51BA72C95993"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "training"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-064e0f7878348c4a3"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - subnet_ids                = [
                  - "subnet-00dd6ad17f28e0110",
                  - "subnet-073345847327cab44",
                  - "subnet-0aff3cd4393d112eb",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIxMDgyMzExMTIzOFoXDTMxMDgyMTExMTIzOFowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALYc
            IVK+ynXzXjJozAwT8BdY4Zy0CWn1+a/VS+fDajXBsrOnhFl2qDwaWQ3TYG7ixvBp
            THP72N1iz+ZmbTbKnvE+Ebg0C+zei3ZJPRvPB5xLV7O1FNd9O7s1rdE9rOJ1aW6m
            WiQXQRBrOndGsCy4I5BeIqquYncpxEiLdKmxh3ZnTkMnajdw7SOJn+QXFo4taULL
            kDzl/wQEm7vt1ch6Qrefg/caAUBMiLZ01fJ2/sRltpSWZKl925eFcoDOpUfUoYq+
            A5rb45a+W9mZBc1qq2HQpTn5p3Q9RYqBxDXNFT0lWfTPhXYol6VjfEJ9PAR8ciQ4
            Y69IQFEFeqlHBHWwQWECAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFNqS7eUiEKSNuFG0PLo4/dE/lMe8MA0GCSqGSIb3
            DQEBCwUAA4IBAQCDVBZD6RdzbTy6YL0uAdAUbToy0zgLNBT6svGk+5w2DuLQRNqf
            CIZRXXwgdulWBqjZBwL6UhyOj9HElCJvTFvHannAxaazC6YF4lqnPyAK9C1tqQu3
            1/u2NpYm/tVEtVsim8bgaJvxWhFaVE9iHTCCHXlkxOBD5ejiyx3ozJp0rcl22h40
            ZASNHuTNSC3iidHMANfJguo2YFPXD1yxpn/kKXvJpddzoy4G40gVFIikIyVVv9Ce
            Wr+122tHP4UGvL5iT3x87uyE0kVNy7xdj6wL2YQgZ9lPll4jA9Lg+0nkWzYeo1W8
            YDdBHj1HlvX1b8mqlD5cziKctqgBaPCua5xb
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id               = "https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Mon, 23 Aug 2021 11:41:47 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "71264a04-7ab4-4558-9d21-ef3a3c515b3c"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "f437df4e-6248-46b6-aba4-7179b68c28e7"
        } -> (known after apply)
      ~ url              = "https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210823111616488200000002" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ vpc_zone_identifier       = [
          + "subnet-02b7b75b8875b6f02",
          + "subnet-06dff361d9daa34ea",
          + "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210823111616479900000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ vpc_zone_identifier       = [
          + "subnet-02b7b75b8875b6f02",
          + "subnet-06dff361d9daa34ea",
          + "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekV4TVRJek9Gb1hEVE14TURneU1URXhNVEl6T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFljCklWSyt5blh6WGpKb3pBd1Q4QmRZNFp5MENXbjErYS9WUytmRGFqWEJzck9uaEZsMnFEd2FXUTNUWUc3aXh2QnAKVEhQNzJOMWl6K1ptYlRiS252RStFYmcwQyt6ZWkzWkpQUnZQQjV4TFY3TzFGTmQ5TzdzMXJkRTlyT0oxYVc2bQpXaVFYUVJCck9uZEdzQ3k0STVCZUlxcXVZbmNweEVpTGRLbXhoM1puVGtNbmFqZHc3U09KbitRWEZvNHRhVUxMCmtEemwvd1FFbTd2dDFjaDZRcmVmZy9jYUFVQk1pTFowMWZKMi9zUmx0cFNXWktsOTI1ZUZjb0RPcFVmVW9ZcSsKQTVyYjQ1YStXOW1aQmMxcXEySFFwVG41cDNROVJZcUJ4RFhORlQwbFdmVFBoWFlvbDZWamZFSjlQQVI4Y2lRNApZNjlJUUZFRmVxbEhCSFd3UVdFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZOcVM3ZVVpRUtTTnVGRzBQTG80L2RFL2xNZThNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDRFZCWkQ2UmR6YlR5NllMMHVBZEFVYlRveTB6Z0xOQlQ2c3ZHays1dzJEdUxRUk5xZgpDSVpSWFh3Z2R1bFdCcWpaQndMNlVoeU9qOUhFbENKdlRGdkhhbm5BeGFhekM2WUY0bHFuUHlBSzlDMXRxUXUzCjEvdTJOcFltL3RWRXRWc2ltOGJnYUp2eFdoRmFWRTlpSFRDQ0hYbGt4T0JENWVqaXl4M296SnAwcmNsMjJoNDAKWkFTTkh1VE5TQzNpaWRITUFOZkpndW8yWUZQWEQxeXhwbi9rS1h2SnBkZHpveTRHNDBnVkZJaWtJeVZWdjlDZQpXcisxMjJ0SFA0VUd2TDVpVDN4ODd1eUUwa1ZOeTd4ZGo2d0wyWVFnWjlsUGxsNGpBOUxnKzBua1d6WWVvMVc4CllEZEJIajFIbHZYMWI4bXFsRDVjemlLY3RxZ0JhUEN1YTV4YgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-23 11:06:35.964 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/9C224726DF76F313B6AF51BA72C95993"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Environment" = "training"
        }
        # (3 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-064e0f7878348c4a3" -> (known after apply)
          ~ subnet_ids                = [ # forces replacement
              + "subnet-02b7b75b8875b6f02",
              + "subnet-06dff361d9daa34ea",
              + "subnet-0a134ea213c4bf0e2",
                # (3 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:b76e23bc-3e35-4bf1-90b2-f99c2be5e3b5:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210823111616488200000002" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210823111616488200000002" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210823111616488200000002" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrVjRUVlJKZWs5R2IxaEVWRTE0VFVSbmVVMVVSWGhOVkVsNlQwWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVEZsakNrbFdTeXQ1YmxoNldHcEtiM3BCZDFRNFFtUlpORnA1TUVOWGJqRXJZUzlXVXl0bVJHRnFXRUp6Y2s5dWFFWnNNbkZFZDJGWFVUTlVXVWMzYVhoMlFuQUtWRWhRTnpKT01XbDZLMXB0WWxSaVMyNTJSU3RGWW1jd1F5dDZaV2t6V2twUVVuWlFRalY0VEZZM1R6RkdUbVE1VHpkek1YSmtSVGx5VDBveFlWYzJiUXBYYVZGWVVWSkNjazl1WkVkelEzazBTVFZDWlVseGNYVlpibU53ZUVWcFRHUkxiWGhvTTFwdVZHdE5ibUZxWkhjM1UwOUtiaXRSV0Vadk5IUmhWVXhNQ210RWVtd3ZkMUZGYlRkMmRERmphRFpSY21WbVp5OWpZVUZWUWsxcFRGb3dNV1pLTWk5elVteDBjRk5YV2t0c09USTFaVVpqYjBSUGNGVm1WVzlaY1NzS1FUVnlZalExWVN0WE9XMWFRbU14Y1hFeVNGRndWRzQxY0ROUk9WSlpjVUo0UkZoT1JsUXdiRmRtVkZCb1dGbHZiRFpXYW1aRlNqbFFRVkk0WTJsUk5BcFpOamxKVVVaRlJtVnhiRWhDU0ZkM1VWZEZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWk9jVk0zWlZWcFJVdFRUblZHUnpCUVRHODBMMlJGTDJ4TlpUaE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkRSRlpDV2tRMlVtUjZZbFI1TmxsTU1IVkJaRUZWWWxSdmVUQjZaMHhPUWxRMmMzWkhheXMxZHpKRWRVeFJVazV4WmdwRFNWcFNXRmgzWjJSMWJGZENjV3BhUW5kTU5sVm9lVTlxT1VoRmJFTktkbFJHZGtoaGJtNUJlR0ZoZWtNMldVWTBiSEZ1VUhsQlN6bERNWFJ4VVhVekNqRXZkVEpPY0ZsdEwzUldSWFJXYzJsdE9HSm5ZVXAyZUZkb1JtRldSVGxwU0ZSRFEwaFliR3Q0VDBKRU5XVnFhWGw0TTI5NlNuQXdjbU5zTWpKb05EQUtXa0ZUVGtoMVZFNVRRek5wYVdSSVRVRk9aa3BuZFc4eVdVWlFXRVF4ZVhod2JpOXJTMWgyU25Ca1pIcHZlVFJITkRCblZrWkphV3RKZVZaV2RqbERaUXBYY2lzeE1qSjBTRkEwVlVkMlREVnBWRE40T0RkMWVVVXdhMVpPZVRkNFpHbzJkMHd5V1ZGbldqbHNVR3hzTkdwQk9VeG5LekJ1YTFkNldXVnZNVmM0Q2xsRVpFSklhakZJYkhaWU1XSTRiWEZzUkRWamVtbExZM1J4WjBKaFVFTjFZVFY0WWdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vOUMyMjQ3MjZERjc2RjMxM0I2QUY1MUJBNzJDOTU5OTMuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:b76a7dad-1c3b-41af-a407-99181b91be5f:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210823111616479900000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210823111616479900000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210823111616479900000001" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrVjRUVlJKZWs5R2IxaEVWRTE0VFVSbmVVMVVSWGhOVkVsNlQwWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVEZsakNrbFdTeXQ1YmxoNldHcEtiM3BCZDFRNFFtUlpORnA1TUVOWGJqRXJZUzlXVXl0bVJHRnFXRUp6Y2s5dWFFWnNNbkZFZDJGWFVUTlVXVWMzYVhoMlFuQUtWRWhRTnpKT01XbDZLMXB0WWxSaVMyNTJSU3RGWW1jd1F5dDZaV2t6V2twUVVuWlFRalY0VEZZM1R6RkdUbVE1VHpkek1YSmtSVGx5VDBveFlWYzJiUXBYYVZGWVVWSkNjazl1WkVkelEzazBTVFZDWlVseGNYVlpibU53ZUVWcFRHUkxiWGhvTTFwdVZHdE5ibUZxWkhjM1UwOUtiaXRSV0Vadk5IUmhWVXhNQ210RWVtd3ZkMUZGYlRkMmRERmphRFpSY21WbVp5OWpZVUZWUWsxcFRGb3dNV1pLTWk5elVteDBjRk5YV2t0c09USTFaVVpqYjBSUGNGVm1WVzlaY1NzS1FUVnlZalExWVN0WE9XMWFRbU14Y1hFeVNGRndWRzQxY0ROUk9WSlpjVUo0UkZoT1JsUXdiRmRtVkZCb1dGbHZiRFpXYW1aRlNqbFFRVkk0WTJsUk5BcFpOamxKVVVaRlJtVnhiRWhDU0ZkM1VWZEZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWk9jVk0zWlZWcFJVdFRUblZHUnpCUVRHODBMMlJGTDJ4TlpUaE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkRSRlpDV2tRMlVtUjZZbFI1TmxsTU1IVkJaRUZWWWxSdmVUQjZaMHhPUWxRMmMzWkhheXMxZHpKRWRVeFJVazV4WmdwRFNWcFNXRmgzWjJSMWJGZENjV3BhUW5kTU5sVm9lVTlxT1VoRmJFTktkbFJHZGtoaGJtNUJlR0ZoZWtNMldVWTBiSEZ1VUhsQlN6bERNWFJ4VVhVekNqRXZkVEpPY0ZsdEwzUldSWFJXYzJsdE9HSm5ZVXAyZUZkb1JtRldSVGxwU0ZSRFEwaFliR3Q0VDBKRU5XVnFhWGw0TTI5NlNuQXdjbU5zTWpKb05EQUtXa0ZUVGtoMVZFNVRRek5wYVdSSVRVRk9aa3BuZFc4eVdVWlFXRVF4ZVhod2JpOXJTMWgyU25Ca1pIcHZlVFJITkRCblZrWkphV3RKZVZaV2RqbERaUXBYY2lzeE1qSjBTRkEwVlVkMlREVnBWRE40T0RkMWVVVXdhMVpPZVRkNFpHbzJkMHd5V1ZGbldqbHNVR3hzTkdwQk9VeG5LekJ1YTFkNldXVnZNVmM0Q2xsRVpFSklhakZJYkhaWU1XSTRiWEZzUkRWamVtbExZM1J4WjBKaFVFTjFZVFY0WWdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vOUMyMjQ3MjZERjc2RjMxM0I2QUY1MUJBNzJDOTU5OTMuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822084331718600000007"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 5 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = {} -> null
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ annotations      = {} -> null
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "567" -> (known after apply)
                  ~ uid              = "373aec2f-2f71-4dd9-9b3f-0a91e693dc4d" -> (known after apply)
                    # (3 unchanged elements hidden)
                },
            ]
            # (1 unchanged element hidden)
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://9C224726DF76F313B6AF51BA72C95993.sk1.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekV4TVRJek9Gb1hEVE14TURneU1URXhNVEl6T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFljCklWSyt5blh6WGpKb3pBd1Q4QmRZNFp5MENXbjErYS9WUytmRGFqWEJzck9uaEZsMnFEd2FXUTNUWUc3aXh2QnAKVEhQNzJOMWl6K1ptYlRiS252RStFYmcwQyt6ZWkzWkpQUnZQQjV4TFY3TzFGTmQ5TzdzMXJkRTlyT0oxYVc2bQpXaVFYUVJCck9uZEdzQ3k0STVCZUlxcXVZbmNweEVpTGRLbXhoM1puVGtNbmFqZHc3U09KbitRWEZvNHRhVUxMCmtEemwvd1FFbTd2dDFjaDZRcmVmZy9jYUFVQk1pTFowMWZKMi9zUmx0cFNXWktsOTI1ZUZjb0RPcFVmVW9ZcSsKQTVyYjQ1YStXOW1aQmMxcXEySFFwVG41cDNROVJZcUJ4RFhORlQwbFdmVFBoWFlvbDZWamZFSjlQQVI4Y2lRNApZNjlJUUZFRmVxbEhCSFd3UVdFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZOcVM3ZVVpRUtTTnVGRzBQTG80L2RFL2xNZThNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDRFZCWkQ2UmR6YlR5NllMMHVBZEFVYlRveTB6Z0xOQlQ2c3ZHays1dzJEdUxRUk5xZgpDSVpSWFh3Z2R1bFdCcWpaQndMNlVoeU9qOUhFbENKdlRGdkhhbm5BeGFhekM2WUY0bHFuUHlBSzlDMXRxUXUzCjEvdTJOcFltL3RWRXRWc2ltOGJnYUp2eFdoRmFWRTlpSFRDQ0hYbGt4T0JENWVqaXl4M296SnAwcmNsMjJoNDAKWkFTTkh1VE5TQzNpaWRITUFOZkpndW8yWUZQWEQxeXhwbi9rS1h2SnBkZHpveTRHNDBnVkZJaWtJeVZWdjlDZQpXcisxMjJ0SFA0VUd2TDVpVDN4ODd1eUUwa1ZOeTd4ZGo2d0wyWVFnWjlsUGxsNGpBOUxnKzBua1d6WWVvMVc4CllEZEJIajFIbHZYMWI4bXFsRDVjemlLY3RxZ0JhUEN1YTV4YgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*